---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryConnectorData.Angle
source: html/407406a0-9ea6-10b8-ce30-715861bc160e.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryConnectorData.Angle Property

The angle of the fitting, Units:(rad).

## Syntax (C#)
```csharp
public double Angle { get; }
```